<details><summary>Digger run report at 2023-10-28 02:41:46 (UTC)</summary>
  <details><summary>Apply for <b>michelmorin/devops-terraform-aws-static-site#vpc-dev</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Environment" = "Dev"
          + "Extra"       = "Michel"
          + "Name"        = "vpc-Dev-default"
          + "Region"      = "us-east-1"
          + "Service"     = "devops-terraform-aws-static-site"
        }
      + tags_all               = {
          + "Environment" = "Dev"
          + "Extra"       = "Michel"
          + "Name"        = "vpc-Dev-default"
          + "Region"      = "us-east-1"
          + "Service"     = "devops-terraform-aws-static-site"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
    }

  # aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Environment" = "Dev"
          + "Extra"       = "Michel"
          + "Name"        = "vpc-Dev-default"
          + "Region"      = "us-east-1"
          + "Service"     = "devops-terraform-aws-static-site"
        }
      + tags_all               = {
          + "Environment" = "Dev"
          + "Extra"       = "Michel"
          + "Name"        = "vpc-Dev-default"
          + "Region"      = "us-east-1"
          + "Service"     = "devops-terraform-aws-static-site"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "Dev"
          + "Extra"       = "Michel"
          + "Name"        = "vpc-Dev-default"
          + "Region"      = "us-east-1"
          + "Service"     = "devops-terraform-aws-static-site"
        }
      + tags_all               = {
          + "Environment" = "Dev"
          + "Extra"       = "Michel"
          + "Name"        = "vpc-Dev-default"
          + "Region"      = "us-east-1"
          + "Service"     = "devops-terraform-aws-static-site"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "Dev"
          + "Extra"       = "Michel"
          + "Name"        = "vpc-Dev"
          + "Region"      = "us-east-1"
          + "Service"     = "devops-terraform-aws-static-site"
        }
      + tags_all = {
          + "Environment" = "Dev"
          + "Extra"       = "Michel"
          + "Name"        = "vpc-Dev"
          + "Region"      = "us-east-1"
          + "Service"     = "devops-terraform-aws-static-site"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "Dev"
          + "Extra"       = "Michel"
          + "Name"        = "vpc-Dev-public"
          + "Region"      = "us-east-1"
          + "Service"     = "devops-terraform-aws-static-site"
        }
      + tags_all         = {
          + "Environment" = "Dev"
          + "Extra"       = "Michel"
          + "Name"        = "vpc-Dev-public"
          + "Region"      = "us-east-1"
          + "Service"     = "devops-terraform-aws-static-site"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Dev"
          + "Extra"       = "Michel"
          + "Name"        = "vpc-Dev-public-us-east-1a"
          + "Region"      = "us-east-1"
          + "Service"     = "devops-terraform-aws-static-site"
        }
      + tags_all                                       = {
          + "Environment" = "Dev"
          + "Extra"       = "Michel"
          + "Name"        = "vpc-Dev-public-us-east-1a"
          + "Region"      = "us-east-1"
          + "Service"     = "devops-terraform-aws-static-site"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Dev"
          + "Extra"       = "Michel"
          + "Name"        = "vpc-Dev-public-us-east-1b"
          + "Region"      = "us-east-1"
          + "Service"     = "devops-terraform-aws-static-site"
        }
      + tags_all                                       = {
          + "Environment" = "Dev"
          + "Extra"       = "Michel"
          + "Name"        = "vpc-Dev-public-us-east-1b"
          + "Region"      = "us-east-1"
          + "Service"     = "devops-terraform-aws-static-site"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.103.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Dev"
          + "Extra"       = "Michel"
          + "Name"        = "vpc-Dev-public-us-east-1c"
          + "Region"      = "us-east-1"
          + "Service"     = "devops-terraform-aws-static-site"
        }
      + tags_all                                       = {
          + "Environment" = "Dev"
          + "Extra"       = "Michel"
          + "Name"        = "vpc-Dev-public-us-east-1c"
          + "Region"      = "us-east-1"
          + "Service"     = "devops-terraform-aws-static-site"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment" = "Dev"
          + "Extra"       = "Michel"
          + "Name"        = "vpc-Dev"
          + "Region"      = "us-east-1"
          + "Service"     = "devops-terraform-aws-static-site"
        }
      + tags_all                             = {
          + "Environment" = "Dev"
          + "Extra"       = "Michel"
          + "Name"        = "vpc-Dev"
          + "Region"      = "us-east-1"
          + "Service"     = "devops-terraform-aws-static-site"
        }
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + azs                                         = [
      + "us-east-1a",
      + "us-east-1b",
      + "us-east-1c",
    ]
  + cgw_arns                                    = []
  + cgw_ids                                     = []
  + database_nat_gateway_route_ids              = []
  + database_route_table_association_ids        = []
  + database_route_table_ids                    = []
  + database_subnet_arns                        = []
  + database_subnets                            = []
  + database_subnets_cidr_blocks                = []
  + database_subnets_ipv6_cidr_blocks           = []
  + default_network_acl_id                      = (known after apply)
  + default_route_table_id                      = (known after apply)
  + default_security_group_id                   = (known after apply)
  + elasticache_route_table_association_ids     = []
  + elasticache_route_table_ids                 = []
  + elasticache_subnet_arns                     = []
  + elasticache_subnets                         = []
  + elasticache_subnets_cidr_blocks             = []
  + elasticache_subnets_ipv6_cidr_blocks        = []
  + igw_arn                                     = (known after apply)
  + igw_id                                      = (known after apply)
  + intra_route_table_association_ids           = []
  + intra_route_table_ids                       = []
  + intra_subnet_arns                           = []
  + intra_subnets                               = []
  + intra_subnets_cidr_blocks                   = []
  + intra_subnets_ipv6_cidr_blocks              = []
  + name                                        = "vpc-Dev"
  + nat_ids                                     = []
  + nat_public_ips                              = []
  + natgw_ids                                   = []
  + outpost_subnet_arns                         = []
  + outpost_subnets                             = []
  + outpost_subnets_cidr_blocks                 = []
  + outpost_subnets_ipv6_cidr_blocks            = []
  + private_ipv6_egress_route_ids               = []
  + private_nat_gateway_route_ids               = []
  + private_route_table_association_ids         = []
  + private_route_table_ids                     = []
  + private_subnet_arns                         = []
  + private_subnets                             = []
  + private_subnets_cidr_blocks                 = []
  + private_subnets_ipv6_cidr_blocks            = []
  + public_internet_gateway_route_id            = (known after apply)
  + public_route_table_association_ids          = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_route_table_ids                      = [
      + (known after apply),
    ]
  + public_subnet_arns                          = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_subnets                              = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_subnets_cidr_blocks                  = [
      + "10.0.101.0/24",
      + "10.0.102.0/24",
      + "10.0.103.0/24",
    ]
  + public_subnets_ipv6_cidr_blocks             = []
  + redshift_public_route_table_association_ids = []
  + redshift_route_table_association_ids        = []
  + redshift_route_table_ids                    = []
  + redshift_subnet_arns                        = []
  + redshift_subnets                            = []
  + redshift_subnets_cidr_blocks                = []
  + redshift_subnets_ipv6_cidr_blocks           = []
  + this_customer_gateway                       = {}
  + vpc_arn                                     = (known after apply)
  + vpc_cidr_block                              = "10.0.0.0/16"
  + vpc_enable_dns_hostnames                    = true
  + vpc_enable_dns_support                      = true
  + vpc_flow_log_cloudwatch_iam_role_arn        = ""
  + vpc_flow_log_destination_arn                = ""
  + vpc_flow_log_destination_type               = "cloud-watch-logs"
  + vpc_id                                      = (known after apply)
  + vpc_instance_tenancy                        = "default"
  + vpc_ipv6_association_id                     = (known after apply)
  + vpc_ipv6_cidr_block                         = (known after apply)
  + vpc_main_route_table_id                     = (known after apply)
  + vpc_owner_id                                = (known after apply)
  + vpc_secondary_cidr_blocks                   = []
aws_vpc.this[0]: Creating...
aws_vpc.this[0]: Still creating... [10s elapsed]
aws_vpc.this[0]: Creation complete after 11s [id=vpc-0f70fc54a907fa554]
aws_route_table.public[0]: Creating...
aws_default_route_table.default[0]: Creating...
aws_default_security_group.this[0]: Creating...
aws_subnet.public[2]: Creating...
aws_subnet.public[1]: Creating...
aws_subnet.public[0]: Creating...
aws_internet_gateway.this[0]: Creating...
aws_default_network_acl.this[0]: Creating...
aws_default_route_table.default[0]: Creation complete after 1s [id=rtb-0d28ba9659f356e5b]
aws_internet_gateway.this[0]: Creation complete after 1s [id=igw-080414dee3cddd41d]
aws_route_table.public[0]: Creation complete after 1s [id=rtb-010f1571ed89effbd]
aws_route.public_internet_gateway[0]: Creating...
aws_subnet.public[2]: Creation complete after 1s [id=subnet-0c7a0d7214211553e]
aws_subnet.public[1]: Creation complete after 1s [id=subnet-04501e57472a0a8f9]
aws_subnet.public[0]: Creation complete after 1s [id=subnet-055c1469c21807c1d]
aws_route_table_association.public[1]: Creating...
aws_route_table_association.public[2]: Creating...
aws_route_table_association.public[0]: Creating...
aws_default_network_acl.this[0]: Creation complete after 2s [id=acl-0e95f1172dd3f98ca]
aws_route.public_internet_gateway[0]: Creation complete after 1s [id=r-rtb-010f1571ed89effbd1080289494]
aws_route_table_association.public[0]: Creation complete after 1s [id=rtbassoc-012893e92aa02b626]
aws_route_table_association.public[1]: Creation complete after 1s [id=rtbassoc-0062c19893a57178d]
aws_default_security_group.this[0]: Creation complete after 2s [id=sg-05b49319be09522f3]
aws_route_table_association.public[2]: Still creating... [10s elapsed]
aws_route_table_association.public[2]: Creation complete after 14s [id=rtbassoc-0ded0cc9119f06323]

Apply complete! Resources: 13 added, 0 changed, 0 destroyed.

Outputs:

azs = tolist([
  "us-east-1a",
  "us-east-1b",
  "us-east-1c",
])
cgw_arns = []
cgw_ids = []
database_nat_gateway_route_ids = []
database_route_table_association_ids = []
database_route_table_ids = []
database_subnet_arns = []
database_subnets = []
database_subnets_cidr_blocks = tolist([])
database_subnets_ipv6_cidr_blocks = tolist([])
default_network_acl_id = "acl-0e95f1172dd3f98ca"
default_route_table_id = "rtb-0d28ba9659f356e5b"
default_security_group_id = "sg-05b49319be09522f3"
elasticache_route_table_association_ids = []
elasticache_route_table_ids = []
elasticache_subnet_arns = []
elasticache_subnets = []
elasticache_subnets_cidr_blocks = tolist([])
elasticache_subnets_ipv6_cidr_blocks = tolist([])
igw_arn = "arn:aws:ec2:us-east-1:107240085929:internet-gateway/igw-080414dee3cddd41d"
igw_id = "igw-080414dee3cddd41d"
intra_route_table_association_ids = []
intra_route_table_ids = []
intra_subnet_arns = []
intra_subnets = []
intra_subnets_cidr_blocks = tolist([])
intra_subnets_ipv6_cidr_blocks = tolist([])
name = "vpc-Dev"
nat_ids = []
nat_public_ips = tolist([])
natgw_ids = []
outpost_subnet_arns = []
outpost_subnets = []
outpost_subnets_cidr_blocks = tolist([])
outpost_subnets_ipv6_cidr_blocks = tolist([])
private_ipv6_egress_route_ids = []
private_nat_gateway_route_ids = []
private_route_table_association_ids = []
private_route_table_ids = []
private_subnet_arns = []
private_subnets = []
private_subnets_cidr_blocks = tolist([])
private_subnets_ipv6_cidr_blocks = tolist([])
public_internet_gateway_route_id = "r-rtb-010f1571ed89effbd1080289494"
public_route_table_association_ids = [
  "rtbassoc-012893e92aa02b626",
  "rtbassoc-0062c19893a57178d",
  "rtbassoc-0ded0cc9119f06323",
]
public_route_table_ids = [
  "rtb-010f1571ed89effbd",
]
public_subnet_arns = [
  "arn:aws:ec2:us-east-1:107240085929:subnet/subnet-055c1469c21807c1d",
  "arn:aws:ec2:us-east-1:107240085929:subnet/subnet-04501e57472a0a8f9",
  "arn:aws:ec2:us-east-1:107240085929:subnet/subnet-0c7a0d7214211553e",
]
public_subnets = [
  "subnet-055c1469c21807c1d",
  "subnet-04501e57472a0a8f9",
  "subnet-0c7a0d7214211553e",
]
public_subnets_cidr_blocks = tolist([
  "10.0.101.0/24",
  "10.0.102.0/24",
  "10.0.103.0/24",
])
public_subnets_ipv6_cidr_blocks = tolist([])
redshift_public_route_table_association_ids = []
redshift_route_table_association_ids = []
redshift_route_table_ids = tolist([])
redshift_subnet_arns = []
redshift_subnets = []
redshift_subnets_cidr_blocks = tolist([])
redshift_subnets_ipv6_cidr_blocks = tolist([])
this_customer_gateway = {}
vpc_arn = "arn:aws:ec2:us-east-1:107240085929:vpc/vpc-0f70fc54a907fa554"
vpc_cidr_block = "10.0.0.0/16"
vpc_enable_dns_hostnames = true
vpc_enable_dns_support = true
vpc_flow_log_cloudwatch_iam_role_arn = ""
vpc_flow_log_destination_arn = ""
vpc_flow_log_destination_type = "cloud-watch-logs"
vpc_id = "vpc-0f70fc54a907fa554"
vpc_instance_tenancy = "default"
vpc_ipv6_association_id = ""
vpc_ipv6_cidr_block = ""
vpc_main_route_table_id = "rtb-0d28ba9659f356e5b"
vpc_owner_id = "107240085929"
vpc_secondary_cidr_blocks = tolist([])

  ```
</details>
</details>